# Books - Core
Author: Paul Foy

## Part 1: Create an ER Diagram

![image.png](Images/Books-Core-Assignment.png)

## Part 2: Create a database in Python

In [ ]:
import pymysql
from urllib.parse import quote_plus
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pandas as pd

In [ ]:
username = "root"
password = quote_plus("REMOVED") # Using the quote function to make the password compatible
db_name = "books"

In [ ]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection_str = f'mysql+pymysql://{username}:{password}@localhost/{db_name}'

In [ ]:
# Create the engine
engine = create_engine(connection_str)

In [ ]:
# Create a new database
create_database(connection_str)

In [ ]:
# Verify DB exists
database_exists(connection_str)

## Create tables

### Users Table

In [14]:
# Create dataset
import pandas as pd
users = pd.read_csv('Data/bkusers.csv')
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [15]:
# Create new users table
users.to_sql('users', engine, if_exists = 'replace')

3

In [16]:
# Verify
q = """SELECT * FROM users LIMIT 5;"""
pd.read_sql(q, engine)

   index  id first_name  last_name                 email
0      0   1       John        Doe          JD@books.com
1      1   2      Robin      Smith       Robin@books.com
2      2   3     Gloria  Rodriguez  grodriquez@books.com

### Books Table

In [17]:
# Create dataset
import pandas as pd
books = pd.read_csv('Data/bkbooks.csv')
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [18]:
# Create new users table
books.to_sql('books', engine, if_exists = 'replace')

6

In [19]:
# Verify
q = """SELECT * FROM books LIMIT 5;"""
pd.read_sql(q, engine)

   index  id                 title  author_id
0      0   1           The Shining          1
1      1   2                    It          1
2      2   3      The Great Gatsby          2
3      3   4  The Call of the Wild          3
4      4   5   Pride and Prejudice          4

### Authors Table

In [20]:
# Create dataset
import pandas as pd
authors = pd.read_csv('Data/bkauthors.csv')
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [21]:
# Create new users table
authors.to_sql('authors', engine, if_exists = 'replace')

5

In [23]:
# Verify
q = """SELECT * FROM authors LIMIT 5;"""
pd.read_sql(q, engine)

   index  id        author_name
0      0   1       Stephen King
1      1   2  F.Scott Fitgerald
2      2   3        Jack London
3      3   4        Jane Austen
4      4   5       Mary Shelley

### Favorites Table

In [10]:
# Create dataset
import pandas as pd
favs = pd.read_csv('Data/bkfavs.csv')
favs.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [12]:
# Create new users table
favs.to_sql('favs', engine, if_exists = 'replace')

7

In [13]:
# Verify
q = """SELECT * FROM favs LIMIT 5;"""
pd.read_sql(q, engine)

   index  user_id  book_id
0      0        1        1
1      1        1        2
2      2        1        3
3      3        2        4
4      4        2        5

## Verify all tables in Books DB

In [24]:

q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2            favs
3           users